app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2020-01-22 08:09:25.410399"], ["updated_at", "2020-01-22 08:09:25.410399"]]
---
  def create

    list = List.new(list_params)

    list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
   def edit
       @list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "aa"], ["body", "aa"], ["updated_at", "2020-01-23 08:49:13.053382"], ["id", 10]]
---
   def update
        list = List.find(params[:id])
        list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
    def destroy
        list = List.find(params[:id]) #データ(レコード)を1件取得
        list.destroy #データ（レコード）を削除